[
    {
        "id": 1,
        "title": "चार्वाक दर्शन: देवताओं से परे, तर्क के भीतर",
        "imageUrl": "https://images.unsplash.com/photo-1518644730707-00f5dbf240dc?q=80&w=1500&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "summary": "चार्वाक या लोकायत दर्शन भारतीय दर्शन में भौतिकवाद (materialism) का प्रतिनिधित्व करता है, जो केवल प्रत्यक्ष प्रमाण को स्वीकार करता है।",
        "content": "चार्वाक दर्शन, जिसे लोकायत भी कहा जाता है, पूरी तरह से **भौतिकवादी** और संशयवादी (skeptical) विचारधारा पर आधारित है। यह वेदों, पुनर्जन्म, और आत्मा के अस्तित्व को खारिज करता है। उनका मूल सिद्धांत है: 'प्रत्यक्ष ही एकमात्र प्रमाण है'। वे स्वर्ग, नर्क, या किसी अलौकिक शक्ति में विश्वास नहीं करते।\n\n**जीवन का उद्देश्य**\nजीवन का उद्देश्य सुख की प्राप्ति है (Charvaka Hedonism)। चार्वाक मानते हैं कि मृत्यु के बाद सब कुछ समाप्त हो जाता है, इसलिए इस क्षण में सुख भोगना ही एकमात्र समझदारी है। प्रसिद्ध सूक्ति है: '**यावज्जीवेत् सुखं जीवेत्, ऋणं कृत्वा घृतं पिबेत्**' (जब तक जियो, सुख से जियो, कर्ज लेकर भी घी पियो)।\n\n**प्रमुख सिद्धांत:**\n1.  **प्रत्यक्ष प्रमाण:** ज्ञान का एकमात्र वैध स्रोत है।\n2.  **तत्व:** केवल चार तत्व (पृथ्वी, जल, अग्नि, वायु) ही वास्तविक हैं। आकाश तत्व को वे स्वीकार नहीं करते।\n3.  **आत्मा:** आत्मा शरीर का गुण है, जो शरीर के नाश के साथ नष्ट हो जाती है। यह चेतना को शरीर से अलग नहीं मानते।\n\nआधुनिक संदर्भ में, चार्वाक दर्शन हमें तर्क और वैज्ञानिक दृष्टिकोण के महत्व को समझने में मदद करता है।"
    },
    {
        "id": 2,
        "title": "भौतिकवाद का सिद्धांत और इसकी सीमाएँ",
        "imageUrl": "https://images.unsplash.com/photo-1541334991262-cd73f1d8e6a1?q=80&w=1500&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "summary": "यह पोस्ट चार्वाक दर्शन के अंतर्गत आने वाले भौतिकवादी दृष्टिकोण की व्याख्या करती है, जो इंद्रियों द्वारा अनुभव की गई दुनिया पर केंद्रित है।",
        "content": "भौतिकवाद (**Materialism**) एक दार्शनिक दृष्टिकोण है जो मानता है कि 'पदार्थ' (Matter) एकमात्र वास्तविक चीज़ है, और सभी घटनाएँ (मानसिक प्रक्रियाएँ, चेतना सहित) भौतिक अंतःक्रियाओं (physical interactions) का परिणाम हैं। चार्वाक दर्शन इस विचार को भारत में हजारों वर्षों से प्रस्तुत करता रहा है।\n\n**चार्वाक और चेतना**\nचार्वाक के अनुसार, चेतना (Consciousness) भी शरीर के तत्वों (पृथ्वी, जल, अग्नि, वायु) के सही अनुपात में मिलने से उत्पन्न होती है, जैसे कि कुछ विशिष्ट सामग्रियों को मिलाने पर **मादकता** उत्पन्न होती है। जब शरीर नष्ट होता है, तो चेतना भी नष्ट हो जाती है।\n\n**आलोचनाएँ और सीमाएँ:**\nअन्य भारतीय दार्शनिक स्कूलों (जैसे न्याय और मीमांसा) ने हमेशा यह तर्क दिया है कि केवल प्रत्यक्ष प्रमाण ही ज्ञान का एकमात्र स्रोत नहीं हो सकता। वे **अनुमान** (Inference) और **शब्द** (Testimony/Vedas) जैसे प्रमाणों को भी वैध मानते हैं। उदाहरण के लिए, वे चार्वाक से पूछते हैं कि आप **अग्नि में धुआँ** देखकर आग के अस्तित्व का अनुमान कैसे लगाते हैं, यदि आप अनुमान को प्रमाण नहीं मानते?"
    }
]
